<?php
/*******************************************************************************
   Создание контента всплывающей подсказки
   Используется в функции bg_bibfers_get_url(),
   вызывает bg_bibfers_printVerses() - см. ниже
*******************************************************************************/  

function bg_bibfers_getVerses($book, $verurl) {
	$bookTitle = array(						// Полные названия Книг Священного Писания
		// Ветхий Завет
		// Пятикнижие Моисея
		'Gen' 		=>__('Genesis', 'bg_bibfers' ),							//'Книга Бытия', 
		'Ex' 		=>__('Exodus', 'bg_bibfers' ),							//'Книга Исход', 
		'Lev' 		=>__('Leviticus', 'bg_bibfers' ),							//'Книга Левит', 
		'Num' 		=>__('Numbers', 'bg_bibfers' ),							//'Книга Числа', 
		'Deut' 		=>__('Deuteronomy', 'bg_bibfers' ),						//'Второзаконие',
		// «Пророки» (Невиим) 
		'Nav' 		=>__('Joshua (Iesous)', 'bg_bibfers' ),					//'Книга Иисуса Навина',
		'Judg'		=>__('Judges', 'bg_bibfers' ),							//'Книга Судей Израилевых', 
		'Rth' 		=>__('Ruth', 'bg_bibfers' ),							//'Книга Руфь',
		'1Sam' 		=>__('1 Samuel (1 Kingdoms)', 'bg_bibfers' ),			//'Первая книга Царств (Первая книга Самуила)', 
		'2Sam' 		=>__('2 Samuel (2 Kingdoms)', 'bg_bibfers' ),			//'Вторая книга Царств (Вторая книга Самуила)', 
		'1King' 	=>__('1 Kings (3 Kingdoms)', 'bg_bibfers' ),			//'Третья книга Царств (Первая книга Царей)', 
		'2King' 	=>__('2 Kings (4 Kingdoms)', 'bg_bibfers' ),			//'Четвёртая книга Царств (Вторая книга Царей)',
		'1Chron' 	=>__('1 Chronicles (1 Paralipomenon)', 'bg_bibfers' ),	//'Первая книга Паралипоменон (Первая книга Хроник, Первая Летопись)', 
		'2Chron' 	=>__('2 Chronicles (2 Paralipomenon)', 'bg_bibfers' ),	//'Вторая книга Паралипоменон (Вторая книга Хроник, Вторая Летопись)', 
		'Ezr' 		=>__('1 Esdras', 'bg_bibfers' ),						//'Книга Ездры (Первая книга Ездры)', 
		'Nehem' 	=>__('Nehemiah (2 Esdras)', 'bg_bibfers' ),				//'Книга Неемии', 
		'Est' 		=>__('Esther', 'bg_bibfers' ),							//'Книга Есфири',  
		// «Писания» (Ктувим)
		'Job' 		=>__('Job', 'bg_bibfers' ),								//'Книга Иова',
		'Ps' 		=>__('Psalms', 'bg_bibfers' ),							//'Псалтирь', 
		'Prov' 		=>__('Proverbs', 'bg_bibfers' ),						//'Книга Притчей Соломоновых', 
		'Eccl' 		=>__('Ecclesiastes', 'bg_bibfers' ),					//'Книга Екклезиаста, или Проповедника', 
		'Song' 		=>__('Song of Songs (Aisma Aismaton)', 'bg_bibfers' ),	//'Песнь песней Соломона',

		'Is' 		=>__('Isaiah', 'bg_bibfers' ),							//'Книга пророка Исайи', 
		'Jer' 		=>__('Jeremiah', 'bg_bibfers' ),						//'Книга пророка Иеремии',
		'Lam' 		=>__('Lamentations', 'bg_bibfers' ),					//'Книга Плач Иеремии', 
		'Ezek'	 	=>__('Ezekiel', 'bg_bibfers' ),							//'Книга пророка Иезекииля',
		'Dan' 		=>__('Daniel', 'bg_bibfers' ),							//'Книга пророка Даниила', 
		// Двенадцать малых пророков 
		'Hos' 		=>__('Hosea', 'bg_bibfers' ),							//'Книга пророка Осии', 
		'Joel'	 	=>__('Joel', 'bg_bibfers' ),							//'Книга пророка Иоиля',
		'Am' 		=>__('Amos', 'bg_bibfers' ),							//'Книга пророка Амоса', 
		'Avd' 		=>__('Obadiah', 'bg_bibfers' ),							//'Книга пророка Авдия', 
		'Jona' 		=>__('Jonah', 'bg_bibfers' ),							//'Книга пророка Ионы',
		'Mic' 		=>__('Micah', 'bg_bibfers' ),							//'Книга пророка Михея', 
		'Naum' 		=>__('Nahum', 'bg_bibfers' ),							//'Книга пророка Наума',
		'Habak' 	=>__('Habakkuk', 'bg_bibfers' ),						//'Книга пророка Аввакума', 
		'Sofon' 	=>__('Zephaniah', 'bg_bibfers' ),						//'Книга пророка Софонии', 
		'Hag' 		=>__('Haggai', 'bg_bibfers' ),							//'Книга пророка Аггея', 
		'Zah' 		=>__('Zechariah', 'bg_bibfers' ),						//'Книга пророка Захарии',
		'Mal' 		=>__('Malachi', 'bg_bibfers' ),							//'Книга пророка Малахии',
		// Второканонические книги
		'1Mac' 		=>__('1 Maccabees', 'bg_bibfers' ),						//'Первая книга Маккавейская',
		'2Mac' 		=>__('2 Maccabees', 'bg_bibfers' ),						//'Вторая книга Маккавейская', 
		'3Mac' 		=>__('3 Maccabees', 'bg_bibfers' ),						//'Третья книга Маккавейская', 
		'Bar' 		=>__('Baruch', 'bg_bibfers' ),							//'Книга пророка Варуха', 
		'2Ezr' 		=>__('2 Esdras', 'bg_bibfers' ),						//'Вторая книга Ездры', 
		'3Ezr' 		=>__('3 Esdras', 'bg_bibfers' ),						//'Третья книга Ездры',
		'Judf' 		=>__('Judith', 'bg_bibfers' ),							//'Книга Иудифи', 
		'pJer' 		=>__('Letter of Jeremiah', 'bg_bibfers' ),				//'Послание Иеремии', 
		'Solom' 	=>__('Wisdom', 'bg_bibfers' ),							//'Книга Премудрости Соломона',
		'Sir' 		=>__('Sirach', 'bg_bibfers' ),							//'Книга Премудрости Иисуса, сына Сирахова', 
		'Tov' 		=>__('Tobit (Tobias)', 'bg_bibfers' ),					//'Книга Товита',
		// Новый Завет
		// Евангилие
		'Mt' 		=>__('Matthew', 'bg_bibfers' ),							//'Евангелие от Матфея',
		'Mk' 		=>__('Mark', 'bg_bibfers' ),							//'Евангелие от Марка', 
		'Lk' 		=>__('Luke', 'bg_bibfers' ),							//'Евангелие от Луки', 
		'Jn' 		=>__('John', 'bg_bibfers' ),							//'Евангелие от Иоанна', 
		// Деяния и послания Апостолов
		'Act' 		=>__('Acts', 'bg_bibfers' ),							//'Деяния святых Апостолов', 
		'Jac' 		=>__('James', 'bg_bibfers' ),							//'Послание Иакова', 
		'1Pet'	 	=>__('1 Peter', 'bg_bibfers' ),							//'Первое послание Петра', 
		'2Pet'	 	=>__('2 Peter', 'bg_bibfers' ),							//'Второе послание Петра',	
		'1Jn' 		=>__('1 John', 'bg_bibfers' ),							//'Первое послание Иоанна', 
		'2Jn' 		=>__('2 John', 'bg_bibfers' ),							//'Второе послание Иоанна', 
		'3Jn' 		=>__('3 John', 'bg_bibfers' ),							//'Третье послание Иоанна',
		'Juda'	 	=>__('Jude', 'bg_bibfers' ),							//'Послание Иуды', 
		// Послания апостола Павла
		'Rom' 		=>__('Romans', 'bg_bibfers' ),							//'Послание апостола Павла к Римлянам', 
		'1Cor' 		=>__('1 Corinthians', 'bg_bibfers' ),					//'Первое послание апостола Павла к Коринфянам', 
		'2Cor' 		=>__('2 Corinthians', 'bg_bibfers' ),					//'Второе послание апостола Павла к Коринфянам',
		'Gal'	 	=>__('Galatians', 'bg_bibfers' ),						//'Послание апостола Павла к Галатам', 
		'Eph' 		=>__('Ephesians', 'bg_bibfers' ),						//'Послание апостола Павла к Ефесянам', 
		'Phil' 		=>__('Philippians', 'bg_bibfers' ),						//'Послание апостола Павла к Филиппийцам', 
		'Col' 		=>__('Colossians', 'bg_bibfers' ),						//'Послание апостола Павла к Колоссянам',
		'1Thes' 	=>__('1 Thessalonians', 'bg_bibfers' ),					//'Первое послание апостола Павла к Фессалоникийцам (Солунянам)',
		'2Thes' 	=>__('2 Thessalonians', 'bg_bibfers' ),					//'Второе послание апостола Павла к Фессалоникийцам (Солунянам)',  
		'1Tim' 		=>__('1 Timothy', 'bg_bibfers' ),						//'Первое послание апостола Павла к Тимофею', 
		'2Tim'	 	=>__('2 Timothy', 'bg_bibfers' ),						//'Второе послание апостола Павла к Тимофею',
		'Tit' 		=>__('Titus', 'bg_bibfers' ),							//'Послание апостола Павла к Титу', 
		'Phlm'	 	=>__('Philemon', 'bg_bibfers' ),						//'Послание апостола Павла к Филимону', 
		'Hebr'	 	=>__('Hebrews', 'bg_bibfers' ),							//'Послание апостола Павла к Евреям', 
		'Apok' 		=>__('Revelation', 'bg_bibfers' ));						//'Откровение Иоанна Богослова (Апокалипсис)'

	$pat = array(						// Таблица соответствия azbyka.ru и patriarhia.ru
		// Ветхий Завет
		// Пятикнижие Моисея
		'Gen'	 	=>'gen',							//'Книга Бытия', 
		'Ex'	 	=>'ex',								//'Книга Исход', 
		'Lev'	 	=>'lev',							//'Книга Левит', 
		'Num'	 	=>'num',							//'Книга Числа', 
		'Deut'	 	=>'deu',							//'Второзаконие',
		// «Пророки» (Невиим) 
		'Nav'	 	=>'nav',							//'Книга Иисуса Навина',
		'Judg'		=>'sud',							//'Книга Судей Израилевых', 
		'Rth'	 	=>'ruf',							//'Книга Руфь',
		'1Sam'	 	=>'king1',							//'Первая книга Царств (Первая книга Самуила)', 
		'2Sam'	 	=>'king2',							//'Вторая книга Царств (Вторая книга Самуила)', 
		'1King' 	=>'king3',							//'Третья книга Царств (Первая книга Царей)', 
		'2King' 	=>'king4',							//'Четвёртая книга Царств (Вторая книга Царей)',
		'1Chron' 	=>'para1',							//'Первая книга Паралипоменон (Первая книга Хроник, Первая Летопись)', 
		'2Chron' 	=>'para2',							//'Вторая книга Паралипоменон (Вторая книга Хроник, Вторая Летопись)', 
		'Ezr'	 	=>'ezr1',							//'Книга Ездры (Первая книга Ездры)', 
		'Nehem' 	=>'nee',							//'Книга Неемии', 
		'Est'	 	=>'esf',							//'Книга Есфири',  
		// «Писания» (Ктувим)
		'Job'	 	=>'iov',							//'Книга Иова',
		'Ps' 		=>'ps',								//'Псалтирь', 
		'Prov'	 	=>'prov',							//'Книга Притчей Соломоновых', 
		'Eccl'	 	=>'eccl',							//'Книга Екклезиаста, или Проповедника', 
		'Song'	 	=>'song',							//'Песнь песней Соломона',

		'Is' 		=>'isa',							//'Книга пророка Исайи', 
		'Jer' 		=>'jer',							//'Книга пророка Иеремии',
		'Lam' 		=>'lam',							//'Книга Плач Иеремии', 
		'Ezek'	 	=>'eze',							//'Книга пророка Иезекииля',
		'Dan' 		=>'dan',							//'Книга пророка Даниила', 
		// Двенадцать малых пророков 
		'Hos' 		=>'hos',							//'Книга пророка Осии', 
		'Joel'	 	=>'joe',							//'Книга пророка Иоиля',
		'Am' 		=>'am',								//'Книга пророка Амоса', 
		'Avd' 		=>'avd',							//'Книга пророка Авдия', 
		'Jona'	 	=>'jona',							//'Книга пророка Ионы',
		'Mic' 		=>'mih',							//'Книга пророка Михея', 
		'Naum' 		=>'nau',							//'Книга пророка Наума',
		'Habak' 	=>'avv',							//'Книга пророка Аввакума', 
		'Sofon' 	=>'sof',							//'Книга пророка Софонии', 
		'Hag' 		=>'agg',							//'Книга пророка Аггея', 
		'Zah' 		=>'zah',							//'Книга пророка Захарии',
		'Mal' 		=>'mal',							//'Книга пророка Малахии',
		// Второканонические книги
		'1Mac'	 	=>'mak1',							//'Первая книга Маккавейская',
		'2Mac'	 	=>'mak2',							//'Вторая книга Маккавейская', 
		'3Mac'	 	=>'mak3',							//'Третья книга Маккавейская', 
		'Bar' 		=>'varuh',							//'Книга пророка Варуха', 
		'2Ezr' 		=>'ezr2',							//'Вторая книга Ездры', 
		'3Ezr' 		=>'ezr3',							//'Третья книга Ездры',
		'Judf' 		=>'jdi',							//'Книга Иудифи', 
		'pJer' 		=>'posjer',							//'Послание Иеремии', 
		'Solom' 	=>'prem',							//'Книга Премудрости Соломона',
		'Sir' 		=>'sir',							//'Книга Премудрости Иисуса, сына Сирахова', 
		'Tov' 		=>'tov',							//'Книга Товита',
		// Новый Завет
		// Евангилие
		'Mt' 		=>'mf',								//'Евангелие от Матфея',
		'Mk' 		=>'mk',								//'Евангелие от Марка', 
		'Lk' 		=>'lk',								//'Евангелие от Луки', 
		'Jn' 		=>'jn',								//'Евангелие от Иоанна', 
		// Деяния и послания Апостолов
		'Act' 		=>'act',							//'Деяния святых Апостолов', 
		'Jac'	 	=>'jak',							//'Послание Иакова', 
		'1Pet'	 	=>'pe1',							//'Первое послание Петра', 
		'2Pet'	 	=>'pe2',							//'Второе послание Петра',	
		'1Jn'	 	=>'jn1',							//'Первое послание Иоанна', 
		'2Jn'	 	=>'jn2',							//'Второе послание Иоанна', 
		'3Jn'	 	=>'jn3',							//'Третье послание Иоанна',
		'Juda'	 	=>'jud',							//'Послание Иуды', 
		// Послания апостола Павла
		'Rom' 		=>'rom',							//'Послание апостола Павла к Римлянам', 
		'1Cor'	 	=>'co1',							//'Первое послание апостола Павла к Коринфянам', 
		'2Cor'	 	=>'co2',							//'Второе послание апостола Павла к Коринфянам',
		'Gal' 		=>'gal',							//'Послание апостола Павла к Галатам', 
		'Eph' 		=>'eph',							//'Послание апостола Павла к Ефесянам', 
		'Phil'	 	=>'flp',							//'Послание апостола Павла к Филиппийцам', 
		'Col' 		=>'col',							//'Послание апостола Павла к Колоссянам',
		'1Thes',	'fe1',								//'Первое послание апостола Павла к Фессалоникийцам (Солунянам)',
		'2Thes' 	=>'fe2',							//'Второе послание апостола Павла к Фессалоникийцам (Солунянам)',  
		'1Tim' 		=>'ti1',							//'Первое послание апостола Павла к Тимофею', 
		'2Tim' 		=>'ti2',							//'Второе послание апостола Павла к Тимофею',
		'Tit' 		=>'tit',							//'Послание апостола Павла к Титу', 
		'Phlm'	 	=>'flm',							//'Послание апостола Павла к Филимону', 
		'Hebr'	 	=>'heb',							//'Послание апостола Павла к Евреям', 
		'Apok'	 	=>'rev');							//'Откровение Иоанна Богослова (Апокалипсис)'

/*******************************************************************************
   Проверяем настройки
*******************************************************************************/  
	$bg_verses_val = get_option( 'g_bibfers_show_verses' );	
	// Формируем полный текст всплывающей подсказки
	$title_book = $bookTitle[$book];													// Полное наименование книги Библии
	// translators: ch. - is abbr. "chapter"
	if ($bg_verses_val != 'on') {														// Только номера глав и стихов
		return "<b>".$title_book."</b><br>".(__('ch. ', 'bg_bibfers' ))." ".$chapter;							
	}	

/*******************************************************************************
   Преобразование обозначения книги из формата azbyka.ru в формат patriarhia.ru
   чтение и преобразование файла книги
*******************************************************************************/  
	$book_file = $pat[$book];																// Имя файла книги
	$book_file = plugins_url( '/bible/'.$book_file , dirname(__FILE__) );					// Адрес файла книги
	$code = file_get_contents($book_file);													// Получить данные с сайта
/*
	if ($code == FALSE) {
		print_r(error_get_last());
		echo "<br><br>";
	}
*/
	$json = json_decode($code, true);														// Преобразовать json в массив

/*******************************************************************************
   Разбор ссылки и формирование текста стихов Библии
  
*******************************************************************************/  
	
	$jj = 0;
	while (preg_match("/\\d+/u", $verurl, $matches, PREG_OFFSET_CAPTURE)) {					// Должно быть число - номер главы 
		$jj++;																				// Защита от зацикливания (не более 10 циклов)
		if ($jj > 10) return "***";
		$ch1 = (int)$matches[0][0];
//		echo " -> ".$matches[0][0];
		$verurl = substr($verurl,(int)$matches[0][1]);
		if (preg_match("/\\:|\\,|\\-/u", $verurl, $matches, PREG_OFFSET_CAPTURE)) {			// Допускается: двоеточие, запятая, тире или <конец строки>
			$sp = $matches[0][0];
//			echo " -> ".$matches[0][0];
			$verurl = substr($verurl,(int)$matches[0][1]);
		} else $sp = "";
		
		if (strcasecmp ($sp, ":") == 0) {
//		Двоеточие - далее стихи
			$ii = 0;
			while (preg_match("/\\d+/u", $verurl, $matches, PREG_OFFSET_CAPTURE)) {			// Должно быть число - номер стиха 
				$ii++;																		// Защита от зацикливания (не более 10 циклов)
				if ($ii >10) return "***";
				$vr1 = (int)$matches[0][0];
//				echo " -> ".$matches[0][0];
				$verurl = substr($verurl,(int)$matches[0][1]);
				if (preg_match("/\\:|\\,|\\-/u", $verurl, $matches, PREG_OFFSET_CAPTURE)) {	// Допускается:  двоеточие, запятая, тире или <конец строки>
					$sp = $matches[0][0];
//					echo " -> ".$matches[0][0];
					$verurl = substr($verurl,(int)$matches[0][1]);
				} else $sp = "";
				if (strcasecmp ($sp, ":") == 0) {											// Если двоеточие, то не номер стиха, а номер главы и далее стихи
					$ch1 = $vr1;
				} else {
					if (strcasecmp ($sp, "-") == 0) {
						preg_match("/\\d+/u", $verurl, $matches, PREG_OFFSET_CAPTURE);		// Должно быть число - номер стиха 
						$vr2 = (int)$matches[0][0];
//						echo " -> ".$matches[0][0];
						$verurl = substr($verurl,(int)$matches[0][1]);
						if (preg_match("/\\,/u", $verurl, $matches, PREG_OFFSET_CAPTURE)) {	// Допускается: запятая или <конец строки>
							$sp = $matches[0][0];
//							echo " -> ".$matches[0][0];
							$verurl = substr($verurl,(int)$matches[0][1]);
						} else $sp = "";
					} else {
						$vr2 = $vr1;
					}
					$verses = $verses.bg_bibfers_printVerses ($json, $ch1, $ch1, $vr1, $vr2);
					if ($sp == "") break;
				}
			}
		} else {
//		Далее до двоеточия только главы
			if (strcasecmp ($sp, "-") == 0) {
				preg_match("/\\d+/u", $verurl, $matches, PREG_OFFSET_CAPTURE);				// Должно быть число - номер главы 
				$ch2 = (int)$matches[0][0];
//				echo " -> ".$matches[0][0];
				$verurl = substr($verurl,(int)$matches[0][1]);
				if (preg_match("/\\,/u", $verurl, $matches, PREG_OFFSET_CAPTURE)) {			// Допускается: запятая или <конец строки>
					$sp = $matches[0][0];
//					echo " -> ".$matches[0][0];
					$verurl = substr($verurl,(int)$matches[0][1]);
				} else $sp = "";
			} else {
				$ch2 = $ch1;
			}
			$verses = $verses.bg_bibfers_printVerses ($json, $ch1, $ch2, 1, 999);
		}
		if ($sp == "") break;
	}
//  
//	echo $verses;
	return "<strong>".$title_book."</strong><br>".$verses;
}
/*******************************************************************************
	Формирование содержания всплывающей подсказки
  
*******************************************************************************/  
function bg_bibfers_printVerses ($json, $ch1, $ch2, $vr1, $vr2) {
	$verses = "";																	
	$cn_json = count($json);
	for ($i=0; $i < $cn_json; $i++) {
		$ch = (int)$json[$i][part];
		$vr = (int)$json[$i][stix];
		if ( $ch >= $ch1 && $ch <= $ch2) {
			if ( $vr >= $vr1 && $vr <= $vr2) {
				$verses = $verses."<em>".$json[$i][part].":".$json[$i][stix]."</em> ".strip_tags($json[$i][text])."<br>";
			}
		}
	}
	return $verses;
}
?>